Repository: zersh01/QPing
Catalog: translations/*/LC_MESSAGES/qping.po
Languages: ru

source: Restore
ru: Восстановить

source: Quit
ru: Выход

source: Help
ru: Справка

source: User Guide
ru: Руководство пользователя

source: Language
ru: Язык

source: Enter IP/domain
ru: Добавить IP/Домен

source: Add Host
ru: Добавить хост

source: Import from File
ru: Добавить из файла

source: Interval: {}ms
ru: Скорость: {}мс

source: Notifications: On
ru: Уведомления: ВКЛ

source: Notifications: Off
ru: Уведомления: ВЫКЛ

source: Show Failed Hosts
ru: Только недоступные хосты

source: Show All Hosts
ru: Показать все хосты

source: Interval:
ru: Скорость:

source: Monitored Hosts:
ru: Адрес:

source: <h2>Ping Monitor User Guide</h2>
ru: <h2>Краткая справка Ping Monitor</h2>

source: <p>Ping Monitor is a tool for monitoring the availability of network hosts using ICMP ping or TCP port checks.</p>
ru: <p>Ping Monitor утилита проверки и мониторинга доступности серверов по ICMP или TCP порту</p>

source: <h3>Getting Started</h3>
ru: Запуск

source: <ul><li><b>Add a host</b>: Enter an IP address or domain in the input field and click 'Add Host' or press Enter.</li><li><b>Import hosts</b>: Use 'Import from File' to add multiple hosts from a text file (one host per line).</li><li><b>Monitor hosts</b>: The application automatically starts pinging hosts once added.</li></ul>
ru: <ul><li><b>Добавить хост</b>: Введите IP-адрес или домен в поле ввода и нажмите "Добавить хост" или клавишу Enter.</li><li><b>Импорт хостов</b>: Используйте "Импорт из файла" для добавления нескольких хостов из текстового файла (по одному хосту на строку).</li><li><b>Мониторинг хостов</b>: Приложение автоматически начинает пинговать хосты после их добавления.</li></ul>

source: <h3>Host Management</h3>
ru: <h3>Управление хостами</h3>

source: <ul><li><b>Edit host</b>: Right-click a host in the list and select 'Edit' to change its address (available for a single host).</li><li><b>Delete host</b>: Select one or more hosts, right-click, and select 'Delete' to remove them.</li><li><b>Change check type</b>: Right-click a host, select 'Check Type', and choose 'ICMP Ping' or 'TCP Port'. For TCP, specify a port number (1–65535). Available for a single host.</li><li><b>Reorder hosts</b>: Drag and drop hosts within or between categories to change their order.</li><li><b>Group hosts</b>: Select one or more hosts, right-click, and select 'Set Category' to assign them to an existing category or create a new one. Categories are collapsible and show the number of hosts in parentheses. Graphs are grouped by categories with separators.</li><li><b>Navigate to graph</b>: Double-click a host in the list to scroll to its graph.</li><li><b>Filter hosts</b>: Click 'Show Failed Hosts' to display only hosts with a failed last check. Click 'Show All Hosts' to return to the full list.</li><li><b>Prioritize host check</b>: Double-click a host's graph to temporarily prioritize its check, ensuring it is checked next without changing its position in the list or graph order.</li></ul>
ru: <ul><li><b>Редактировать узел</b>: Щелкните правой кнопкой мыши узел в списке и выберите "Редактировать", чтобы изменить его адрес (доступно для одного узла).</li><li><b>Удалить узел</b>: Выберите один или несколько узлов, щелкните правой кнопкой мыши и выберите "Удалить", чтобы удалить их.</li><li><b>Изменить тип проверки</b>: Щелкните правой кнопкой мыши узел, выберите "Тип проверки" и выберите "ICMP Ping" или "TCP-порт". Для протокола TCP укажите номер порта (1-65535). Доступно для одного хоста.</li><li><b>Переупорядочить хосты</b>: Перетаскивайте хосты внутри категорий или между ними, чтобы изменить их порядок.</li><li><b>Сгруппировать хосты</b>: Выберите один или несколько хостов, нажмите и выберите "Установить категорию", чтобы отнести их к существующей категории или создать новую. Категории являются разборными и в круглых скобках указано количество хостов. Графики сгруппированы по категориям с разделителями.</li><li><b>Переход к графику</b>: дважды щелкните узел в списке, чтобы перейти к его графику.</li><li><b>Отфильтровать узлы</b>: нажмите "Только недоступные хосты" для отображения только хостов с неудачной последней проверкой. Нажмите "Показать все хосты", чтобы вернуться к полному списку.</li><li><b>Форсировать проверку хоста</b>: Дважды щелкните на графике хоста.</li></ul>

source: <h3>Time Scale</h3>
ru: <h3>Временная шкала</h3>

source: <ul><li><b>Zoom</b>: Click on the time scale to set start and end points for zooming. Right-click to reset to default (1 hour centered on current time).</li><li><b>Scroll zoom</b>: Use the mouse wheel to zoom in/out while maintaining the cursor's time position.</li><li><b>View history</b>: The graph shows ping results as green (success) or red (failure) bars.</li></ul>
ru: <ul><li><b>Масштабирование</b>: Щелкните по шкале времени, чтобы задать начальную и конечную точки для масштабирования. Щелкните правой кнопкой мыши, чтобы вернуться к значению по умолчанию (1 час по текущему времени).</li><li><b>Масштаб прокрутки</b>: Используйте колесико мыши для увеличения / уменьшения масштаба, сохраняя при этом положение курсора по времени.</li><li><b>Просмотр истории</b>: На графике результаты проверки связи отображаются в виде зеленых (успешных) или красных (неудачных) полос. Желтых - единичных провалов.</li></ul>

source: <h3>System Tray</h3>
ru: <h3>Системный трэй</h3>

source: <ul><li><b>Minimize</b>: Closing the window minimizes the application to the system tray.</li><li><b>Restore</b>: Double-click the tray icon or select 'Restore' from the tray menu to show the window.</li><li><b>Quit</b>: Select 'Quit' from the tray menu to close the application.</li></ul>
ru: <ul><li><b>Свернуть</b>: При закрытии окна приложение будет перенесено в системный трей.</li><li><b>Восстановить</b>: Дважды щелкните значок в трее или выберите "Восстановить" в меню трея, чтобы отобразить окно.</li><li><b>Выход</b>: Выберите "Выход" в меню в трее, чтобы закрыть приложение.</li></ul>

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

source: Check Type
ru: Тип проверки

source: TCP Port
ru: Порт TCP

source: Set Category
ru: Установить категорию

source: Enter port number (1-65535):
ru: Введите номер порта(1-65535):

source: New Category
ru: Новая категория

source: Enter new category name
ru: Название категории

source: Delete {} hosts?
ru: Удалить {} хосты?

source: Select host file
ru: Выбрать файл с хостами

source: Import completed
ru: Импорт завершен

source: Successfully added {} hosts from file.
ru: Успешно добавлено {}

source: Import failed
ru: Не удалось импортировать

source: No new hosts added (they may already exist).
ru: Новые хосты отсутствуют (добавлены ранее)

source: Import error
ru: Ошибка импорта

source: Failed to read file: {}
ru: Ошибка чтения файла: {}

source: Host unavailable
ru: Хост недоступен

source: Host {} is not responding to check
ru: Сервер {} не отвечает

source: New host name:
ru: Новое имя
